
public class Basic {
/*
	물리와 논리.
	
	상대적이다. 추상적이다 구체적이다와 같이 물리적이다 논리적이다는개념적인 것이라 기억하면 된다.
	상세하게 들어가서 내부적으로 정의가 가능하다. -> 물리명과 논리명이 존재한다.
	
	자연어 -> 소리나는 대로 나오는 언어.
	
	논리적이다 -> 육하원칙, 약속 된 표현에 의해서 정의되는 단어와 글은 논리의 영역이다.
			     누구에게 설명하던 달라지지 않는다.
			     
	물리적이다 -> 논리가 말이나 어떤 것을 설명한다고 하면 조금더 딱딱하고 기계에 가까운 것이 물리이다.
			     바로 사용이 가능하다. 무겁고 변화가 쉽지 않으며 바로 사용 할 수 있는 것을 물리라고 표현한다. 
	
	논리적인 설명이 있으면 실제로 행할 수 있는 것에는 물리적이라고 한다.
	
	
	DataBase에 적용하기
	
	논리 -> 업무에 관련 된 사람에게 설명할 수 있는 것이 논리
	물리 -> 개발자의 입장에서 논리의 영역보다 물리의 영역에서 코딩을 진행한다.
	
	표나 ERD가 업무로 우리에게 온다.
	우리가 타이핑을 할 수 있는 것은 물리의 영역이다. 
	
	
	
	
	
*/	
}
