
public class Theory {
	
//	패키지(Package)
/*	
	클래스의 묶음이다
	서로 관련 된 클래스들 끼리 그룹 단위로 묶어 놓음으로써 클래스를
	효율적으로 관리할 수 있다.
	
	다른 개발자가 개발한 클래스 라이브러리의 클래스와 이름이 충돌하는 것을
	피할 수 있다.
	
	클래스의 실제 이름은 패키지명을 포함한 것이다(full name)
	
	같은 이름의 클래스일 지라도 서로 다른 패키지에 속하면 패키지명으로 구별이 가능하다.
	
	클래스가 물리적으로 하나의 클래스파일(.class) 인 것과 같이
	패키지는 물리적으로 하나의 디렉토리이다
	
	- 하나의 소스파일에는 첫 번째 문장으로 한 한번의 패키지 선언만을 허용한다.
	- 모드 ㄴ클래스는 반드시 하나의 패키지에 속해야 한다.
	- 패키지는 점(.)을 구분자로 하여 계층구조로 구성할 수 있다
	- 패키지는 물리적으로 클래스 파일(.class)을 포함하는 하나의 디렉토리이다.
	
	
	패키지 선언
	
	package 패키지명;
	
	패키지 선언문은 반드시 소스파일에서 주석과 공백을 제외한
	첫 번째 문장이어야 하며,
	하나의 소스파일에 단 한번만 선언 될 수 있다
	패키지명은 소문자로 하는 것을 원칙으로 하고있다.
	

	모든 클래스는 반드시 하나의 패키지에 포함되어야 한다
	
	
*/	
	
	
}
