
public class CastingEx3 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
/*
		형변환(Casting) 이란?
		
		형변환이란, 변수 또는 상수의 타입을 다른 타입으로 변환하는 것
		
		방법
		(타입)피연산자
*/		
		
//		묵시적 
//		눈에 보이지 않지만 어딘가에서 처리되고 있음 => 자동
//		
//		명시적
//		눈에 보임, 명확하게 표시함 => 수동
		
//		명시적 형변환, 자동 형변환
		
//		자동 형변환
//		기존의 값을 최대한 보존ㄴ할 수 있는 타입으로 자동 형변환한다.
//		
//		byte -> short -> int -> long -> float -> double
//				char ->
//		기본형의 자동 형변환이 가능한 방향
		
//		1. boolean을 제외한 나머지 7개의 기본형은 서로 형변환이 가능하다.
//		2. 기본형과 참조형은 서로 형변환 할 수 없다.
//		3. 서로 다른 타입의 변수간의 연산은 형변환을 하는 것이 원칙이지만,
//		값의 범위가 작은 타입에서 큰 타입으로의 형변환은 생략할 수 있다.
		
		
		byte a = 1;
		int b = 2;
		long c = 3;
		
//		a = b;
//		b = c;
		
		c = b;
		b = a;
//		=> 작은 것들이 큰 것에 들어가면 자동으로 형변환이 된다.
		double d = 4.0;
		
		d = a;
		d = b;
		d = c;
		
//		c = d; // long에는 .이 없기 때문에 오류가 나타나는 것이다.
		
		
		
		
		
	}

}
