
public class Interitance {
/*	
  
 	상속 다형성 캡슐화 -> 객체지향의 핵심 코어이자 기본
 	
	상속(Interitance)
	
	상속이란?
			기존의 클래스를 재사용하여 새로운 클래스를 작성하는 것
			상송을 통해서 클래스를 작성하면 보다 적은 양의 코드로 
			새로운 클래스를 작성할 수 있고
			코드를 공통적으로 관리할 수 있기 때문에
			코드의 추가 및 변경이 매우 용이하다
			
			상속 구현 방법
			class 클래스 명 extends parentClass명{
		
	}
	
	조상 클래스 : 부모(parent) 클래서, 상위(super) 클래스 등
	자손 클래스 : 자식(child) 클래스, 하위(sub) 클래스 등
	
	
*/	
/*	
	자식 클래스에 새로운 코드가 추가되어도 부모 클래스에는 아무런 영향도 받지 않는다
	부모 클래스가 변경되면 자동적으로 자식에게 영향을 주게 된다
	
	자식 클래스는 부모 클래스의 모든 멤버를 상속 받으므로 항상 부모 클래스보다
	같거나 많은 멤버를 갖는다
 	
	그래서 상속을 받는다는 것은 부모 클래스를 확장(extend)한다는 의미로
	해석할 수도 있으며 이것이 상속에 사용되는 키워드인 이유이기도 하다
	
	-생성자는 상속되지 않는다. 멤버만 상속된다.
	-자식 클래스의 멤버 개수는 부모 클래스보다 항상 같거나 많아야한다
	
	
	
	
*/	
}
